-module(base_tcp_client_sup).

-behaviour(supervisor).
%% --------------------------------------------------------------------
%% Include files
%% --------------------------------------------------------------------

%% --------------------------------------------------------------------
%% External exports
%% --------------------------------------------------------------------
-export([
	start_link/1,
	get_client_count/0
]).

%% --------------------------------------------------------------------
%% Internal exports
%% --------------------------------------------------------------------
-export([init/1]).

%% --------------------------------------------------------------------
%% Macros
%% --------------------------------------------------------------------

%% --------------------------------------------------------------------
%% Records
%% --------------------------------------------------------------------

get_client_count()->
	%% count_children函数在新版的OTP库中存在
	%%supervisor:count_children(?MODULE).
	not_implement.

%% ====================================================================
%% External functions
%% ====================================================================
start_link([OnReceiveData,OnClientClose])->
	supervisor:start_link({local, ?MODULE},?MODULE, [OnReceiveData,OnClientClose]).

%% ====================================================================
%% Server functions
%% ====================================================================
%% --------------------------------------------------------------------
%% Func: init/1
%% Returns: {ok,  {SupFlags,  [ChildSpec]}} |
%%          ignore                          |
%%          {error, Reason}
%% --------------------------------------------------------------------
init([OnReceiveData,OnClientClose]) ->
	base_logger_util:msg("~p:~p~n",[?MODULE,?FUNCTION_NAME]),
	{ok,{{simple_one_for_one,5, 60}, 
	     [{base_tcp_client_fsm, 				%% target process noname
	       {base_tcp_client_fsm,start_link,[OnReceiveData,OnClientClose]},
	       temporary, 				%% target process is temporary
	       brutal_kill,worker,[]}]}}.

%% ====================================================================
%% Internal functions
%% ====================================================================

